Revit 2027 API
OverrideGraphicSettings(OverrideGraphicSettings) Constructor
 Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings(
	OverrideGraphicSettings overrideGraphicSettings
)
Public Sub New (
	overrideGraphicSettings As OverrideGraphicSettings
)
public:
OverrideGraphicSettings(
	OverrideGraphicSettings^ overrideGraphicSettings
)
new :
        overrideGraphicSettings : OverrideGraphicSettings -> OverrideGraphicSettings
Parameters
overrideGraphicSettings OverrideGraphicSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
OverrideGraphicSettings Overload
Autodesk.Revit.DB Namespace